BRBPortal_CSharp/StaticData/UpdateUserPassword_Request.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:api="http://cityofberkeley.info/RTS/ClientPortal/API">
  <soapenv:Header/>
  <soapenv:Body>
    <api:updateUserPassword>
      <updateUserPwdReq>
        <!--Optional:-->
        <userId>DAVE02</userId>
        <!--Optional:-->
        <billingCode>LIUHEL</billingCode>
        <currentPwd>_9Y@$JirPtkE</currentPwd>
        <newPwd>Testing@1234</newPwd>
        <retypeNewPwd>Testing@1234</retypeNewPwd>
      </updateUserPwdReq>
    </api:updateUserPassword>
  </soapenv:Body>
</soapenv:Envelope>